# Lab 04 - pandas II

Name: Andrew Hawk  
Class: CSCI 349 - Intro to Data Mining  
Semester: 2020SP  
Instructor: Brain King

In [5]:
import sys
import numpy as np
import pandas as pd

In [6]:
days = ["Mon","Tue","Wed","Thurs","Fri","Student"]
scores = pd.DataFrame([pd.Series([9.5, 8.75, 8, 10, 7.75, "Bob"], index=days, name="week_1"),
pd.Series([9, 8, 10, 8.75, 7.25, "Jane"], index=days, name="week_1"),
pd.Series([8.5, 0, 9.75, 9, 6, "Bob"], index=days, name="week_2"),
pd.Series([7, 8.25, 9.25, 0, 8, "Jane"], index=days, name="week_2"),
pd.Series([7, 8.5, 9.25, 0, 0, "Bob"], index=days, name="week_3"),
pd.Series([8.5, 8.25, 9, 8, 7.5, "Jane"], index=days, name="week_3"),
pd.Series([9, 7, 8.5, 8, 8, "Bob"], index=days, name="week_4"),
pd.Series([9.25, 9.25, 8.5, 7.75, 7.5, "Jane"], index=days,

name="week_4"),
])
scores

         Mon   Tue    Wed  Thurs   Fri Student
week_1  9.50  8.75   8.00  10.00  7.75     Bob
week_1  9.00  8.00  10.00   8.75  7.25    Jane
week_2  8.50  0.00   9.75   9.00  6.00     Bob
week_2  7.00  8.25   9.25   0.00  8.00    Jane
week_3  7.00  8.50   9.25   0.00  0.00     Bob
week_3  8.50  8.25   9.00   8.00  7.50    Jane
week_4  9.00  7.00   8.50   8.00  8.00     Bob
week_4  9.25  9.25   8.50   7.75  7.50    Jane

### 1) [P] Report the shape, the number of dimensions, the size of the data, and the data types of each column.Print each separately. Then create an additional code cell that shows the results of scores.info().

In [7]:
display("shape:", scores.shape)
display("# of dimensions:", scores.ndim)
display("size of data:", scores.size)
display("data types of each column:", scores.dtypes)

'shape:'

(8, 6)

'# of dimensions:'

2

'size of data:'

48

'data types of each column:'

Mon        float64
Tue        float64
Wed        float64
Thurs      float64
Fri        float64
Student     object
dtype: object

In [8]:
scores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, week_1 to week_4
Data columns (total 6 columns):
Mon        8 non-null float64
Tue        8 non-null float64
Wed        8 non-null float64
Thurs      8 non-null float64
Fri        8 non-null float64
Student    8 non-null object
dtypes: float64(5), object(1)
memory usage: 448.0+ bytes

### 2) [P] Show two different ways to report the number of observations in scores.

In [9]:
# WRONG - Total observations is number of rows
display(scores.size)
display(len(scores)*len(scores.columns))

48

48

### 3) [P] Show the variables (i.e. columns) in scores

In [10]:
display(scores.columns)

Index(['Mon', 'Tue', 'Wed', 'Thurs', 'Fri', 'Student'], dtype='object')

### 4) [P] There are repetitive names in the index. This happens quite a bit, depending on how the rows are to be named. For now. print the unique index names in scores

In [11]:
display(scores.index.nunique())

4

### 5) [P] Rename the 'Thurs' column header to be 'Thu' . (Hint: Changing scores.columns[3] directly will not work, not to mention it would be a poor approach to hard code a location this way! Magic numbers be bad when referencing index or column locations. They may change!) Show the new scores data frame. This should be the same, except with Thurs changed to Thu.

In [12]:
days[3] = "Thu"
scores.columns = days
scores

         Mon   Tue    Wed    Thu   Fri Student
week_1  9.50  8.75   8.00  10.00  7.75     Bob
week_1  9.00  8.00  10.00   8.75  7.25    Jane
week_2  8.50  0.00   9.75   9.00  6.00     Bob
week_2  7.00  8.25   9.25   0.00  8.00    Jane
week_3  7.00  8.50   9.25   0.00  0.00     Bob
week_3  8.50  8.25   9.00   8.00  7.50    Jane
week_4  9.00  7.00   8.50   8.00  8.00     Bob
week_4  9.25  9.25   8.50   7.75  7.50    Jane

### 6) [P] Now, make a bigger change. Let's rename 'week_1' to be 'w1', 'week_2' to be 'w2', and so on. Also, suppose you decide to use only 2 letter abbreviations for the days. Rename the days in the column names to be 'Mo', 'Tu', 'We', 'Th', 'Fr'.

In [13]:
scores = scores.rename(columns ={"Mon":"Mo", "Tue":"Tu", "Wed":"We", "Thu":"Th", "Fri":"Fr"}, index = {"week_1": "w1", "week_2": "w2", "week_3": "w3", "week_4": "w4"})
scores

      Mo    Tu     We     Th    Fr Student
w1  9.50  8.75   8.00  10.00  7.75     Bob
w1  9.00  8.00  10.00   8.75  7.25    Jane
w2  8.50  0.00   9.75   9.00  6.00     Bob
w2  7.00  8.25   9.25   0.00  8.00    Jane
w3  7.00  8.50   9.25   0.00  0.00     Bob
w3  8.50  8.25   9.00   8.00  7.50    Jane
w4  9.00  7.00   8.50   8.00  8.00     Bob
w4  9.25  9.25   8.50   7.75  7.50    Jane

### 7) [P] Compare the type of the expression scores['Mo'] vs. scores[['Mo']]. What is the difference?(HINT: use the type() Python function on both.)

In [14]:
display(type(scores["Mo"])) # returns a series
display(type(scores[["Mo"]])) # returns a dataframe

pandas.core.series.Series

pandas.core.frame.DataFrame

### 8) [P] Demonstrate the describe() method on scores. What type does it return? From your observations of the output, which day had the largest standard deviation in quiz scores? (You can just hard code the answer to this question. You'll write code to do this next.)

In [15]:
display(type(scores.describe())) # Outputs a dataframe
scores.describe() # Thursday had the largest standard deviation in quiz scores

pandas.core.frame.DataFrame

             Mo      Tu         We         Th        Fr
count  8.000000  8.0000   8.000000   8.000000  8.000000
mean   8.468750  7.2500   9.031250   6.437500  6.500000
std    0.967669  3.0000   0.673974   4.037215  2.702512
min    7.000000  0.0000   8.000000   0.000000  0.000000
25%    8.125000  7.7500   8.500000   5.812500  6.937500
50%    8.750000  8.2500   9.125000   8.000000  7.500000
75%    9.062500  8.5625   9.375000   8.812500  7.812500
max    9.500000  9.2500  10.000000  10.000000  8.000000

### 9) [P] While you could look at the output of describe() and infer information, it's more important to write code to output the specific results you are looking for. Write the Python code that shows the largest standard deviation and the day it occurred without using describe().

In [16]:
print("Largest std:",scores.std().max())
print("Day it occurred:",scores.std().idxmax())

Largest std: 4.037215270809465
Day it occurred: Th

### 10) [P] Write the code that changes all 0.0 entries to np.nan. (NOTE: You should be able to do this with just one line of code using pandas selection techniques!) Then, show scores. All 0.0 entries should be replaced with NaN in the output.

In [17]:
scores = scores.replace(to_replace=0.0, value=np.nan)
scores

      Mo    Tu     We     Th    Fr Student
w1  9.50  8.75   8.00  10.00  7.75     Bob
w1  9.00  8.00  10.00   8.75  7.25    Jane
w2  8.50   NaN   9.75   9.00  6.00     Bob
w2  7.00  8.25   9.25    NaN  8.00    Jane
w3  7.00  8.50   9.25    NaN   NaN     Bob
w3  8.50  8.25   9.00   8.00  7.50    Jane
w4  9.00  7.00   8.50   8.00  8.00     Bob
w4  9.25  9.25   8.50   7.75  7.50    Jane

### 11) [P] Show the output of describe() again. Yes, this is better! Note how much more informative this output is when properly dealing with missing data. Copy your code from above to output the day with the largest standard deviation in quiz scores. You should have a substantially different result than you did before!

In [18]:
display(scores.describe())
print("Largest std:",scores.std().max())
print("Day it occurred:",scores.std().idxmax())

             Mo        Tu         We         Th        Fr
count  8.000000  7.000000   8.000000   6.000000  7.000000
mean   8.468750  8.285714   9.031250   8.583333  7.428571
std    0.967669  0.698638   0.673974   0.846562  0.687906
min    7.000000  7.000000   8.000000   7.750000  6.000000
25%    8.125000  8.125000   8.500000   8.000000  7.375000
50%    8.750000  8.250000   9.125000   8.375000  7.500000
75%    9.062500  8.625000   9.375000   8.937500  7.875000
max    9.500000  9.250000  10.000000  10.000000  8.000000

Largest std: 0.9676693281133947
Day it occurred: Mo

### 12) [P] Show the output of scores.values. What does the .values attribute do?

In [19]:
scores.values
# The .values attribute returns a numpy representation of the dataframe

array([[9.5, 8.75, 8.0, 10.0, 7.75, 'Bob'],
       [9.0, 8.0, 10.0, 8.75, 7.25, 'Jane'],
       [8.5, nan, 9.75, 9.0, 6.0, 'Bob'],
       [7.0, 8.25, 9.25, nan, 8.0, 'Jane'],
       [7.0, 8.5, 9.25, nan, nan, 'Bob'],
       [8.5, 8.25, 9.0, 8.0, 7.5, 'Jane'],
       [9.0, 7.0, 8.5, 8.0, 8.0, 'Bob'],
       [9.25, 9.25, 8.5, 7.75, 7.5, 'Jane']], dtype=object)

### 13) [P] What is the mean quiz score for each day? Do not use describe()

In [20]:
scores.mean()

Mo    8.468750
Tu    8.285714
We    9.031250
Th    8.583333
Fr    7.428571
dtype: float64

### 14) [P] What is the mean quiz score over the entire dataset? (HINT: there are many ways to do this, and none should involve writing any loops! The only right answer is 8.375. If you aren't getting that, then you are not handling NaN values correctly. You only want the mean over all scores that are NOT NaN!)

In [21]:
#Wrong - does not account for NaN values
scores.mean().sum()/5

8.359523809523811

### 15) [P] Now, show the mean for each week over all students. Again, you are not counting missing quizzes into the average. (Yes, technically you could write a loop to compute this exhaustively. However, you should rarely need to do that. Use pandas!)

In [22]:
# Ref: https://stackoverflow.com/questions/29108341/pandas-dataframe-float-formatting
print("Mean for each week: ")
scores.mean(axis=1).groupby(scores.index).mean().apply(lambda x: '{:.5f}'.format(x))

#print("w1    {:.5f}".format(scores.loc[scores.index == "w1"].mean(axis=1).sum()/2))
#print("w2    {:.5f}".format(scores.loc[scores.index == "w2"].mean(axis=1).sum()/2))
#print("w3    {:.5f}".format(scores.loc[scores.index == "w3"].mean(axis=1).sum()/2))
#print("w4    {:.5f}".format(scores.loc[scores.index == "w4"].mean(axis=1).sum()/2))

Mean for each week:

w1    8.70000
w2    8.21875
w3    8.25000
w4    8.27500
dtype: object

### 16) [P] Select the data frame for only Monday and Student variables using .loc, and again using .iloc

In [23]:
display(scores.loc[:,["Mo", "Student"]])
display(scores.iloc[:,[0,5]])

      Mo Student
w1  9.50     Bob
w1  9.00    Jane
w2  8.50     Bob
w2  7.00    Jane
w3  7.00     Bob
w3  8.50    Jane
w4  9.00     Bob
w4  9.25    Jane

      Mo Student
w1  9.50     Bob
w1  9.00    Jane
w2  8.50     Bob
w2  7.00    Jane
w3  7.00     Bob
w3  8.50    Jane
w4  9.00     Bob
w4  9.25    Jane

### 17) [P] Show a new DataFrame containing the week as an index (like the original), but the mean of their scores and the count of the quizzes they took.

In [24]:
updated_scores = pd.DataFrame(data = {"Student": scores["Student"], "count": scores.iloc[:,0:5].count(axis=1), "mean": scores.mean(axis=1)})
updated_scores

   Student  count    mean
w1     Bob      5  8.8000
w1    Jane      5  8.6000
w2     Bob      4  8.3125
w2    Jane      4  8.1250
w3     Bob      3  8.2500
w3    Jane      5  8.2500
w4     Bob      5  8.1000
w4    Jane      5  8.4500

### 18) [P] Show the number of times Friday's score was greater than 7.25 for each student. Start by selecting your data with the [ ] operator.

In [44]:
#scores[scores>9].groupby("Student").count(
#scores[scores.iloc[:,0:5] > 7.25].loc[:,["Fr"]]
#scores[scores.loc[:,["Fr"]] > 7.25]
#scores.groupby("Student").count().loc[:,["Fr"]]

# scores[scores>9] throws an error since I am attempting
# to do an integer comparison on the Student names. I cannot
# figure out how to do this comparision without the names
# column becoming all null values!

sel = scores.Fr > 7.25 # create a selection vector
scores[sel].Student.value_counts()

Jane    3
Bob     2
Name: Student, dtype: int64

### 19) [P] Use the where() method on scores to repeat the previous exercise. (HINT: You might need to use dropna()). You should have the same output

In [53]:
#scores.where(scores["Fr"] > 7.25, scores.iloc[:,[0,1,2,3,5]]).iloc[:,[4,5]].groupby("Student").count()
scores.where(scores["Fr"] > 7.25, scores.iloc[:,[0,1,2,3,5]]).iloc[:,[4,5]].dropna().Student.value_counts()

Jane    3
Bob     2
Name: Student, dtype: int64

### 20) [P] Select the scores that were greater than the mean score over the entire dataset (without the missing values). Again, no hard coding values here (i.e. do NOT hard code the mean, but recompute it. Then, report the number of scores for each day that exceeded that global mean.

In [27]:
# sum of scores / number of scores that are not empty
mean = scores.iloc[:,:5].sum().sum() / scores.iloc[:,:5].count().sum()
scores[scores.iloc[:,:5] > mean].iloc[:,:5].count()

Mo    6
Tu    3
We    7
Th    3
Fr    0
dtype: int64